results/results_r5_large/results_r5_large_run3/oltp_read_only_t8/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 64.49 qps: 1035.10 (r/w/o: 905.33/0.00/129.78) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 61.90 qps: 992.43 (r/w/o: 868.83/0.00/123.60) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 57.60 qps: 926.30 (r/w/o: 810.90/0.00/115.40) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 67.70 qps: 1081.10 (r/w/o: 945.70/0.00/135.40) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 88.40 qps: 1410.60 (r/w/o: 1234.00/0.00/176.60) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 60.80 qps: 974.90 (r/w/o: 853.20/0.00/121.70) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 58.30 qps: 930.90 (r/w/o: 814.20/0.00/116.70) lat (ms,95%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 62.60 qps: 1005.10 (r/w/o: 880.00/0.00/125.10) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 59.60 qps: 951.69 (r/w/o: 832.40/0.00/119.30) lat (ms,95%): 331.91 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 59.00 qps: 941.60 (r/w/o: 823.70/0.00/117.90) lat (ms,95%): 331.91 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 56.60 qps: 907.40 (r/w/o: 794.10/0.00/113.30) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 63.00 qps: 1006.80 (r/w/o: 881.00/0.00/125.80) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            106512
        write:                           0
        other:                           15216
        total:                           121728
    transactions:                        7608   (63.29 per sec.)
    queries:                             121728 (1012.59 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      63.2870
    time elapsed:                        120.2142s
    total number of events:              7608

Latency (ms):
         min:                                   28.36
         avg:                                  126.34
         max:                                  690.84
         95th percentile:                      297.92
         sum:                               961185.08

Threads fairness:
    events (avg/stddev):           951.0000/11.10
    execution time (avg/stddev):   120.1481/0.06